OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1784.h
extern __at(0x0827) volatile __PSMC1TMRLbits_t PSMC1TMRLbits;

#define _PSMC1TMR0              0x01
#define _PSMC1TMR1              0x02
#define _PSMC1TMR2              0x04
#define _PSMC1TMR3              0x08
#define _PSMC1TMR4              0x10
#define _PSMC1TMR5              0x20
#define _PSMC1TMR6              0x40
#define _PSMC1TMR7              0x80

//==============================================================================


//==============================================================================
//        PSMC1TMRH Bits

extern __at(0x0828) __sfr PSMC1TMRH;

typedef struct
  {
  unsigned PSMC1TMR8            : 1;
  unsigned PSMC1TMR9            : 1;
  unsigned PSMC1TMR10           : 1;
  unsigned PSMC1TMR11           : 1;
  unsigned PSMC1TMR12           : 1;
  unsigned PSMC1TMR13           : 1;
  unsigned PSMC1TMR14           : 1;
  unsigned PSMC1TMR15           : 1;
  } __PSMC1TMRHbits_t;

extern __at(0x0828) volatile __PSMC1TMRHbits_t PSMC1TMRHbits;

#define _PSMC1TMR8              0x01
#define _PSMC1TMR9              0x02
#define _PSMC1TMR10             0x04
#define _PSMC1TMR11             0x08
#define _PSMC1TMR12             0x10
#define _PSMC1TMR13             0x20
#define _PSMC1TMR14             0x40
#define _PSMC1TMR15             0x80

//==============================================================================


//==============================================================================
//        PSMC1DBR Bits

extern __at(0x0829) __sfr PSMC1DBR;

typedef struct
  {
  unsigned PSMC1DBR0            : 1;
  unsigned PSMC1DBR1            : 1;
  unsigned PSMC1DBR2            : 1;
  unsigned PSMC1DBR3            : 1;
  unsigned PSMC1DBR4            : 1;
  unsigned PSMC1DBR5            : 1;
  unsigned PSMC1DBR6            : 1;
  unsigned PSMC1DBR7            : 1;
  } __PSMC1DBRbits_t;

extern __at(0x0829) volatile __PSMC1DBRbits_t PSMC1DBRbits;

#define _PSMC1DBR0              0x01
#define _PSMC1DBR1              0x02
#define _PSMC1DBR2              0x04
#define _PSMC1DBR3              0x08
#define _PSMC1DBR4              0x10
#define _PSMC1DBR5              0x20
#define _PSMC1DBR6              0x40
#define _PSMC1DBR7              0x80

//==============================================================================


//==============================================================================
//        PSMC1DBF Bits

extern __at(0x082A) __sfr PSMC1DBF;

typedef struct
  {
  unsigned PSMC1DBF0            : 1;
  unsigned PSMC1DBF1            : 1;
  unsigned PSMC1DBF2            : 1;
  unsigned PSMC1DBF3            : 1;
  unsigned PSMC1DBF4            : 1;
  unsigned PSMC1DBF5            : 1;
  unsigned PSMC1DBF6            : 1;
  unsigned PSMC1DBF7            : 1;
  } __PSMC1DBFbits_t;

extern __at(0x082A) volatile __PSMC1DBFbits_t PSMC1DBFbits;

#define _PSMC1DBF0              0x01
#define _PSMC1DBF1              0x02
#define _PSMC1DBF2              0x04
#define _PSMC1DBF3              0x08
#define _PSMC1DBF4              0x10
#define _PSMC1DBF5              0x20
#define _PSMC1DBF6              0x40
#define _PSMC1DBF7              0x80

//==============================================================================


//==============================================================================
//        PSMC1BLKR Bits

extern __at(0x082B) __sfr PSMC1BLKR;

typedef struct
  {
  unsigned PSMC1BLKR0           : 1;
  unsigned PSMC1BLKR1           : 1;
  unsigned PSMC1BLKR2           : 1;
  unsigned PSMC1BLKR3           : 1;
  unsigned PSMC1BLKR4           : 1;
  unsigned PSMC1BLKR5           : 1;
  unsigned PSMC1BLKR6           : 1;
  unsigned PSMC1BLKR7           : 1;
  } __PSMC1BLKRbits_t;

extern __at(0x082B) volatile __PSMC1BLKRbits_t PSMC1BLKRbits;

#define _PSMC1BLKR0             0x01
#define _PSMC1BLKR1             0x02
#define _PSMC1BLKR2             0x04
#define _PSMC1BLKR3             0x08
#define _PSMC1BLKR4             0x10
#define _PSMC1BLKR5             0x20
#define _PSMC1BLKR6             0x40
#define _PSMC1BLKR7             0x80

//==============================================================================


//==============================================================================
//        PSMC1BLKF Bits

extern __at(0x082C) __sfr PSMC1BLKF;

typedef struct
  {
  unsigned PSMC1BLKF0           : 1;
  unsigned PSMC1BLKF1           : 1;
  unsigned PSMC1BLKF2           : 1;
  unsigned PSMC1BLKF3           : 1;
  unsigned PSMC1BLKF4           : 1;
  unsigned PSMC1BLKF5           : 1;
  unsigned PSMC1BLKF6           : 1;
  unsigned PSMC1BLKF7           : 1;
  } __PSMC1BLKFbits_t;

extern __at(0x082C) volatile __PSMC1BLKFbits_t PSMC1BLKFbits;

#define _PSMC1BLKF0             0x01
#define _PSMC1BLKF1             0x02
#define _PSMC1BLKF2             0x04
#define _PSMC1BLKF3             0x08
#define _PSMC1BLKF4             0x10
#define _PSMC1BLKF5             0x20
#define _PSMC1BLKF6             0x40
#define _PSMC1BLKF7             0x80

//==============================================================================


//==============================================================================
//        PSMC1FFA Bits

extern __at(0x082D) __sfr PSMC1FFA;

typedef union
  {
  struct
    {
    unsigned PSMC1FFA0          : 1;
    unsigned PSMC1FFA1          : 1;
    unsigned PSMC1FFA2          : 1;
    unsigned PSMC1FFA3          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned PSMC1FFA           : 4;
    unsigned                    : 4;
    };
  } __PSMC1FFAbits_t;

extern __at(0x082D) volatile __PSMC1FFAbits_t PSMC1FFAbits;

#define _PSMC1FFA0              0x01
#define _PSMC1FFA1              0x02
#define _PSMC1FFA2              0x04
#define _PSMC1FFA3              0x08

//==============================================================================


//==============================================================================
//        PSMC1STR0 Bits

extern __at(0x082E) __sfr PSMC1STR0;

typedef struct
  {
  unsigned P1STRA               : 1;
  unsigned P1STRB               : 1;
  unsigned P1STRC               : 1;
  unsigned P1STRD               : 1;
  unsigned P1STRE               : 1;
  unsigned P1STRF               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC1STR0bits_t;

