OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1784.h
extern __at(0x085A) __sfr PSMC3PHS;

typedef struct
  {
  unsigned P3PHST               : 1;
  unsigned P3PHSC1              : 1;
  unsigned P3PHSC2              : 1;
  unsigned P3PHSC3              : 1;
  unsigned P3PHSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3PHSIN              : 1;
  } __PSMC3PHSbits_t;

extern __at(0x085A) volatile __PSMC3PHSbits_t PSMC3PHSbits;

#define _P3PHST                 0x01
#define _P3PHSC1                0x02
#define _P3PHSC2                0x04
#define _P3PHSC3                0x08
#define _P3PHSC4                0x10
#define _P3PHSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC3DCS Bits

extern __at(0x085B) __sfr PSMC3DCS;

typedef struct
  {
  unsigned P3DCST               : 1;
  unsigned P3DCSC1              : 1;
  unsigned P3DCSC2              : 1;
  unsigned P3DCSC3              : 1;
  unsigned P3DCSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3DCSIN              : 1;
  } __PSMC3DCSbits_t;

extern __at(0x085B) volatile __PSMC3DCSbits_t PSMC3DCSbits;

#define _P3DCST                 0x01
#define _P3DCSC1                0x02
#define _P3DCSC2                0x04
#define _P3DCSC3                0x08
#define _P3DCSC4                0x10
#define _P3DCSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC3PRS Bits

extern __at(0x085C) __sfr PSMC3PRS;

typedef struct
  {
  unsigned P3PRST               : 1;
  unsigned P3PRSC1              : 1;
  unsigned P3PRSC2              : 1;
  unsigned P3PRSC3              : 1;
  unsigned P3PRSC4              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3PRSIN              : 1;
  } __PSMC3PRSbits_t;

extern __at(0x085C) volatile __PSMC3PRSbits_t PSMC3PRSbits;

#define _P3PRST                 0x01
#define _P3PRSC1                0x02
#define _P3PRSC2                0x04
#define _P3PRSC3                0x08
#define _P3PRSC4                0x10
#define _P3PRSIN                0x80

//==============================================================================


//==============================================================================
//        PSMC3ASDC Bits

extern __at(0x085D) __sfr PSMC3ASDC;

typedef struct
  {
  unsigned P3ASDOV              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3ARSEN              : 1;
  unsigned P3ASDEN              : 1;
  unsigned P3ASE                : 1;
  } __PSMC3ASDCbits_t;

extern __at(0x085D) volatile __PSMC3ASDCbits_t PSMC3ASDCbits;

#define _P3ASDOV                0x01
#define _P3ARSEN                0x20
#define _P3ASDEN                0x40
#define _P3ASE                  0x80

//==============================================================================


//==============================================================================
//        PSMC3ASDL Bits

extern __at(0x085E) __sfr PSMC3ASDL;

typedef struct
  {
  unsigned P3ASDLA              : 1;
  unsigned P3ASDLB              : 1;
  unsigned P3ASDLC              : 1;
  unsigned P3ASDLD              : 1;
  unsigned P3ASDLE              : 1;
  unsigned P3ASDLF              : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __PSMC3ASDLbits_t;

extern __at(0x085E) volatile __PSMC3ASDLbits_t PSMC3ASDLbits;

#define _P3ASDLA                0x01
#define _P3ASDLB                0x02
#define _P3ASDLC                0x04
#define _P3ASDLD                0x08
#define _P3ASDLE                0x10
#define _P3ASDLF                0x20

//==============================================================================


//==============================================================================
//        PSMC3ASDS Bits

extern __at(0x085F) __sfr PSMC3ASDS;

typedef struct
  {
  unsigned                      : 1;
  unsigned P3ASDSC1             : 1;
  unsigned P3ASDSC2             : 1;
  unsigned P3ASDSC3             : 1;
  unsigned P3ASDSC4             : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned P3ASDSIN             : 1;
  } __PSMC3ASDSbits_t;

extern __at(0x085F) volatile __PSMC3ASDSbits_t PSMC3ASDSbits;

#define _P3ASDSC1               0x02
#define _P3ASDSC2               0x04
#define _P3ASDSC3               0x08
#define _P3ASDSC4               0x10
#define _P3ASDSIN               0x80

//==============================================================================


//==============================================================================
//        PSMC3INT Bits

extern __at(0x0860) __sfr PSMC3INT;

typedef struct
  {
  unsigned P3TPRIF              : 1;
  unsigned P3TDCIF              : 1;
  unsigned P3TPHIF              : 1;
  unsigned P3TOVIF              : 1;
  unsigned P3TPRIE              : 1;
  unsigned P3TDCIE              : 1;
  unsigned P3TPHIE              : 1;
  unsigned P3TOVIE              : 1;
  } __PSMC3INTbits_t;

extern __at(0x0860) volatile __PSMC3INTbits_t PSMC3INTbits;

#define _P3TPRIF                0x01
#define _P3TDCIF                0x02
#define _P3TPHIF                0x04
#define _P3TOVIF                0x08
#define _P3TPRIE                0x10
#define _P3TDCIE                0x20
#define _P3TPHIE                0x40
#define _P3TOVIE                0x80

//==============================================================================

extern __at(0x0861) __sfr PSMC3PH;

//==============================================================================
//        PSMC3PHL Bits

extern __at(0x0861) __sfr PSMC3PHL;

typedef struct
  {
  unsigned PSMC3PH0             : 1;
  unsigned PSMC3PH1             : 1;
  unsigned PSMC3PH2             : 1;
  unsigned PSMC3PH3             : 1;
  unsigned PSMC3PH4             : 1;
  unsigned PSMC3PH5             : 1;
  unsigned PSMC3PH6             : 1;
  unsigned PSMC3PH7             : 1;
  } __PSMC3PHLbits_t;

extern __at(0x0861) volatile __PSMC3PHLbits_t PSMC3PHLbits;

#define _PSMC3PH0               0x01
#define _PSMC3PH1               0x02
#define _PSMC3PH2               0x04
#define _PSMC3PH3               0x08
#define _PSMC3PH4               0x10
#define _PSMC3PH5               0x20
#define _PSMC3PH6               0x40
#define _PSMC3PH7               0x80

//==============================================================================


//==============================================================================
//        PSMC3PHH Bits

extern __at(0x0862) __sfr PSMC3PHH;

typedef struct
  {
  unsigned PSMC3PH8             : 1;
  unsigned PSMC3PH9             : 1;
  unsigned PSMC3PH10            : 1;
  unsigned PSMC3PH11            : 1;
  unsigned PSMC3PH12            : 1;
  unsigned PSMC3PH13            : 1;
  unsigned PSMC3PH14            : 1;
  unsigned PSMC3PH15            : 1;
  } __PSMC3PHHbits_t;

extern __at(0x0862) volatile __PSMC3PHHbits_t PSMC3PHHbits;

#define _PSMC3PH8               0x01
#define _PSMC3PH9               0x02
#define _PSMC3PH10              0x04
#define _PSMC3PH11              0x08
#define _PSMC3PH12              0x10
#define _PSMC3PH13              0x20
#define _PSMC3PH14              0x40
#define _PSMC3PH15              0x80

//==============================================================================

extern __at(0x0863) __sfr PSMC3DC;

//==============================================================================
//        PSMC3DCL Bits

extern __at(0x0863) __sfr PSMC3DCL;

typedef struct
  {
  unsigned PSMC3DC0             : 1;
  unsigned PSMC3DC1             : 1;
  unsigned PSMC3DC2             : 1;
  unsigned PSMC3DC3             : 1;
  unsigned PSMC3DC4             : 1;
  unsigned PSMC3DC5             : 1;
  unsigned PSMC3DC6             : 1;
  unsigned PSMC3DC7             : 1;
  } __PSMC3DCLbits_t;

extern __at(0x0863) volatile __PSMC3DCLbits_t PSMC3DCLbits;

#define _PSMC3DC0               0x01
#define _PSMC3DC1               0x02
#define _PSMC3DC2               0x04
#define _PSMC3DC3               0x08
#define _PSMC3DC4               0x10
#define _PSMC3DC5               0x20
#define _PSMC3DC6               0x40
#define _PSMC3DC7               0x80

//==============================================================================


//==============================================================================
//        PSMC3DCH Bits

extern __at(0x0864) __sfr PSMC3DCH;

typedef struct
  {
  unsigned PSMC3DC8             : 1;
  unsigned PSMC3DC9             : 1;
  unsigned PSMC3DC10            : 1;
  unsigned PSMC3DC11            : 1;
  unsigned PSMC3DC12            : 1;
  unsigned PSMC3DC13            : 1;
  unsigned PSMC3DC14            : 1;
  unsigned PSMC3DC15            : 1;
  } __PSMC3DCHbits_t;

extern __at(0x0864) volatile __PSMC3DCHbits_t PSMC3DCHbits;

#define _PSMC3DC8               0x01
#define _PSMC3DC9               0x02
#define _PSMC3DC10              0x04
#define _PSMC3DC11              0x08
#define _PSMC3DC12              0x10
#define _PSMC3DC13              0x20
#define _PSMC3DC14              0x40
#define _PSMC3DC15              0x80

//==============================================================================

extern __at(0x0865) __sfr PSMC3PR;

//==============================================================================
//        PSMC3PRL Bits

extern __at(0x0865) __sfr PSMC3PRL;

typedef struct
  {
  unsigned PSMC3PR0             : 1;
  unsigned PSMC3PR1             : 1;
  unsigned PSMC3PR2             : 1;
  unsigned PSMC3PR3             : 1;
  unsigned PSMC3PR4             : 1;
  unsigned PSMC3PR5             : 1;
  unsigned PSMC3PR6             : 1;
  unsigned PSMC3PR7             : 1;
  } __PSMC3PRLbits_t;

extern __at(0x0865) volatile __PSMC3PRLbits_t PSMC3PRLbits;

#define _PSMC3PR0               0x01
#define _PSMC3PR1               0x02
#define _PSMC3PR2               0x04
#define _PSMC3PR3               0x08
#define _PSMC3PR4               0x10
#define _PSMC3PR5               0x20
#define _PSMC3PR6               0x40
#define _PSMC3PR7               0x80

//==============================================================================


//==============================================================================
//        PSMC3PRH Bits

extern __at(0x0866) __sfr PSMC3PRH;

typedef struct
  {
  unsigned PSMC3PR8             : 1;
  unsigned PSMC3PR9             : 1;
  unsigned PSMC3PR10            : 1;
  unsigned PSMC3PR11            : 1;
  unsigned PSMC3PR12            : 1;
  unsigned PSMC3PR13            : 1;
  unsigned PSMC3PR14            : 1;
  unsigned PSMC3PR15            : 1;
  } __PSMC3PRHbits_t;

extern __at(0x0866) volatile __PSMC3PRHbits_t PSMC3PRHbits;

