OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1784.h
#define PSMC1TMR0               PSMC1TMRLbits.PSMC1TMR0         // bit 0
#define PSMC1TMR1               PSMC1TMRLbits.PSMC1TMR1         // bit 1
#define PSMC1TMR2               PSMC1TMRLbits.PSMC1TMR2         // bit 2
#define PSMC1TMR3               PSMC1TMRLbits.PSMC1TMR3         // bit 3
#define PSMC1TMR4               PSMC1TMRLbits.PSMC1TMR4         // bit 4
#define PSMC1TMR5               PSMC1TMRLbits.PSMC1TMR5         // bit 5
#define PSMC1TMR6               PSMC1TMRLbits.PSMC1TMR6         // bit 6
#define PSMC1TMR7               PSMC1TMRLbits.PSMC1TMR7         // bit 7

#define P2ASDOV                 PSMC2ASDCbits.P2ASDOV           // bit 0
#define P2ARSEN                 PSMC2ASDCbits.P2ARSEN           // bit 5
#define P2ASDEN                 PSMC2ASDCbits.P2ASDEN           // bit 6
#define P2ASE                   PSMC2ASDCbits.P2ASE             // bit 7

#define P2ASDLA                 PSMC2ASDLbits.P2ASDLA           // bit 0
#define P2ASDLB                 PSMC2ASDLbits.P2ASDLB           // bit 1

#define P2ASDSC1                PSMC2ASDSbits.P2ASDSC1          // bit 1
#define P2ASDSC2                PSMC2ASDSbits.P2ASDSC2          // bit 2
#define P2ASDSC3                PSMC2ASDSbits.P2ASDSC3          // bit 3
#define P2ASDSC4                PSMC2ASDSbits.P2ASDSC4          // bit 4
#define P2ASDSIN                PSMC2ASDSbits.P2ASDSIN          // bit 7

#define PSMC2BLKF0              PSMC2BLKFbits.PSMC2BLKF0        // bit 0
#define PSMC2BLKF1              PSMC2BLKFbits.PSMC2BLKF1        // bit 1
#define PSMC2BLKF2              PSMC2BLKFbits.PSMC2BLKF2        // bit 2
#define PSMC2BLKF3              PSMC2BLKFbits.PSMC2BLKF3        // bit 3
#define PSMC2BLKF4              PSMC2BLKFbits.PSMC2BLKF4        // bit 4
#define PSMC2BLKF5              PSMC2BLKFbits.PSMC2BLKF5        // bit 5
#define PSMC2BLKF6              PSMC2BLKFbits.PSMC2BLKF6        // bit 6
#define PSMC2BLKF7              PSMC2BLKFbits.PSMC2BLKF7        // bit 7

#define PSMC2BLKR0              PSMC2BLKRbits.PSMC2BLKR0        // bit 0
#define PSMC2BLKR1              PSMC2BLKRbits.PSMC2BLKR1        // bit 1
#define PSMC2BLKR2              PSMC2BLKRbits.PSMC2BLKR2        // bit 2
#define PSMC2BLKR3              PSMC2BLKRbits.PSMC2BLKR3        // bit 3
#define PSMC2BLKR4              PSMC2BLKRbits.PSMC2BLKR4        // bit 4
#define PSMC2BLKR5              PSMC2BLKRbits.PSMC2BLKR5        // bit 5
#define PSMC2BLKR6              PSMC2BLKRbits.PSMC2BLKR6        // bit 6
#define PSMC2BLKR7              PSMC2BLKRbits.PSMC2BLKR7        // bit 7

#define P2REBM0                 PSMC2BLNKbits.P2REBM0           // bit 0
#define P2REBM1                 PSMC2BLNKbits.P2REBM1           // bit 1
#define P2FEBM0                 PSMC2BLNKbits.P2FEBM0           // bit 4
#define P2FEBM1                 PSMC2BLNKbits.P2FEBM1           // bit 5

#define P2CSRC0                 PSMC2CLKbits.P2CSRC0            // bit 0
#define P2CSRC1                 PSMC2CLKbits.P2CSRC1            // bit 1
#define P2CPRE0                 PSMC2CLKbits.P2CPRE0            // bit 4
#define P2CPRE1                 PSMC2CLKbits.P2CPRE1            // bit 5

#define P2MODE0                 PSMC2CONbits.P2MODE0            // bit 0
#define P2MODE1                 PSMC2CONbits.P2MODE1            // bit 1
#define P2MODE2                 PSMC2CONbits.P2MODE2            // bit 2
#define P2MODE3                 PSMC2CONbits.P2MODE3            // bit 3
#define P2DBRE                  PSMC2CONbits.P2DBRE             // bit 4
#define P2DBFE                  PSMC2CONbits.P2DBFE             // bit 5
#define PSMC2LD                 PSMC2CONbits.PSMC2LD            // bit 6
#define PSMC2EN                 PSMC2CONbits.PSMC2EN            // bit 7

#define PSMC2DBF0               PSMC2DBFbits.PSMC2DBF0          // bit 0
#define PSMC2DBF1               PSMC2DBFbits.PSMC2DBF1          // bit 1
#define PSMC2DBF2               PSMC2DBFbits.PSMC2DBF2          // bit 2
#define PSMC2DBF3               PSMC2DBFbits.PSMC2DBF3          // bit 3
#define PSMC2DBF4               PSMC2DBFbits.PSMC2DBF4          // bit 4
#define PSMC2DBF5               PSMC2DBFbits.PSMC2DBF5          // bit 5
#define PSMC2DBF6               PSMC2DBFbits.PSMC2DBF6          // bit 6
#define PSMC2DBF7               PSMC2DBFbits.PSMC2DBF7          // bit 7

#define PSMC2DBR0               PSMC2DBRbits.PSMC2DBR0          // bit 0
#define PSMC2DBR1               PSMC2DBRbits.PSMC2DBR1          // bit 1
#define PSMC2DBR2               PSMC2DBRbits.PSMC2DBR2          // bit 2
#define PSMC2DBR3               PSMC2DBRbits.PSMC2DBR3          // bit 3
#define PSMC2DBR4               PSMC2DBRbits.PSMC2DBR4          // bit 4
#define PSMC2DBR5               PSMC2DBRbits.PSMC2DBR5          // bit 5
#define PSMC2DBR6               PSMC2DBRbits.PSMC2DBR6          // bit 6
#define PSMC2DBR7               PSMC2DBRbits.PSMC2DBR7          // bit 7

#define PSMC2DC8                PSMC2DCHbits.PSMC2DC8           // bit 0
#define PSMC2DC9                PSMC2DCHbits.PSMC2DC9           // bit 1
#define PSMC2DC10               PSMC2DCHbits.PSMC2DC10          // bit 2
#define PSMC2DC11               PSMC2DCHbits.PSMC2DC11          // bit 3
#define PSMC2DC12               PSMC2DCHbits.PSMC2DC12          // bit 4
#define PSMC2DC13               PSMC2DCHbits.PSMC2DC13          // bit 5
#define PSMC2DC14               PSMC2DCHbits.PSMC2DC14          // bit 6
#define PSMC2DC15               PSMC2DCHbits.PSMC2DC15          // bit 7

#define PSMC2DC0                PSMC2DCLbits.PSMC2DC0           // bit 0
#define PSMC2DC1                PSMC2DCLbits.PSMC2DC1           // bit 1
#define PSMC2DC2                PSMC2DCLbits.PSMC2DC2           // bit 2
#define PSMC2DC3                PSMC2DCLbits.PSMC2DC3           // bit 3
#define PSMC2DC4                PSMC2DCLbits.PSMC2DC4           // bit 4
#define PSMC2DC5                PSMC2DCLbits.PSMC2DC5           // bit 5
#define PSMC2DC6                PSMC2DCLbits.PSMC2DC6           // bit 6
#define PSMC2DC7                PSMC2DCLbits.PSMC2DC7           // bit 7

#define P2DCST                  PSMC2DCSbits.P2DCST             // bit 0
#define P2DCSC1                 PSMC2DCSbits.P2DCSC1            // bit 1
#define P2DCSC2                 PSMC2DCSbits.P2DCSC2            // bit 2
#define P2DCSC3                 PSMC2DCSbits.P2DCSC3            // bit 3
#define P2DCSC4                 PSMC2DCSbits.P2DCSC4            // bit 4
#define P2DCSIN                 PSMC2DCSbits.P2DCSIN            // bit 7

#define P2FEBSC1                PSMC2FEBSbits.P2FEBSC1          // bit 1
#define P2FEBSC2                PSMC2FEBSbits.P2FEBSC2          // bit 2
#define P2FEBSC3                PSMC2FEBSbits.P2FEBSC3          // bit 3
#define P2FEBSC4                PSMC2FEBSbits.P2FEBSC4          // bit 4
#define P2FEBSIN                PSMC2FEBSbits.P2FEBSIN          // bit 7

#define PSMC2FFA0               PSMC2FFAbits.PSMC2FFA0          // bit 0
#define PSMC2FFA1               PSMC2FFAbits.PSMC2FFA1          // bit 1
#define PSMC2FFA2               PSMC2FFAbits.PSMC2FFA2          // bit 2
#define PSMC2FFA3               PSMC2FFAbits.PSMC2FFA3          // bit 3

#define P2TPRIF                 PSMC2INTbits.P2TPRIF            // bit 0
#define P2TDCIF                 PSMC2INTbits.P2TDCIF            // bit 1
#define P2TPHIF                 PSMC2INTbits.P2TPHIF            // bit 2
#define P2TOVIF                 PSMC2INTbits.P2TOVIF            // bit 3
#define P2TPRIE                 PSMC2INTbits.P2TPRIE            // bit 4
#define P2TDCIE                 PSMC2INTbits.P2TDCIE            // bit 5
#define P2TPHIE                 PSMC2INTbits.P2TPHIE            // bit 6
#define P2TOVIE                 PSMC2INTbits.P2TOVIE            // bit 7

#define P2MSRC0                 PSMC2MDLbits.P2MSRC0            // bit 0
#define P2MSRC1                 PSMC2MDLbits.P2MSRC1            // bit 1
#define P2MSRC2                 PSMC2MDLbits.P2MSRC2            // bit 2
#define P2MSRC3                 PSMC2MDLbits.P2MSRC3            // bit 3
#define P2MDLBIT                PSMC2MDLbits.P2MDLBIT           // bit 5
#define P2MDLPOL                PSMC2MDLbits.P2MDLPOL           // bit 6
#define P2MDLEN                 PSMC2MDLbits.P2MDLEN            // bit 7

#define P2OEA                   PSMC2OENbits.P2OEA              // bit 0
#define P2OEB                   PSMC2OENbits.P2OEB              // bit 1

