OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1784.h
#define PSMC3DBF0               PSMC3DBFbits.PSMC3DBF0          // bit 0
#define PSMC3DBF1               PSMC3DBFbits.PSMC3DBF1          // bit 1
#define PSMC3DBF2               PSMC3DBFbits.PSMC3DBF2          // bit 2
#define PSMC3DBF3               PSMC3DBFbits.PSMC3DBF3          // bit 3
#define PSMC3DBF4               PSMC3DBFbits.PSMC3DBF4          // bit 4
#define PSMC3DBF5               PSMC3DBFbits.PSMC3DBF5          // bit 5
#define PSMC3DBF6               PSMC3DBFbits.PSMC3DBF6          // bit 6
#define PSMC3DBF7               PSMC3DBFbits.PSMC3DBF7          // bit 7

#define PSMC3DBR0               PSMC3DBRbits.PSMC3DBR0          // bit 0
#define PSMC3DBR1               PSMC3DBRbits.PSMC3DBR1          // bit 1
#define PSMC3DBR2               PSMC3DBRbits.PSMC3DBR2          // bit 2
#define PSMC3DBR3               PSMC3DBRbits.PSMC3DBR3          // bit 3
#define PSMC3DBR4               PSMC3DBRbits.PSMC3DBR4          // bit 4
#define PSMC3DBR5               PSMC3DBRbits.PSMC3DBR5          // bit 5
#define PSMC3DBR6               PSMC3DBRbits.PSMC3DBR6          // bit 6
#define PSMC3DBR7               PSMC3DBRbits.PSMC3DBR7          // bit 7

#define PSMC3DC8                PSMC3DCHbits.PSMC3DC8           // bit 0
#define PSMC3DC9                PSMC3DCHbits.PSMC3DC9           // bit 1
#define PSMC3DC10               PSMC3DCHbits.PSMC3DC10          // bit 2
#define PSMC3DC11               PSMC3DCHbits.PSMC3DC11          // bit 3
#define PSMC3DC12               PSMC3DCHbits.PSMC3DC12          // bit 4
#define PSMC3DC13               PSMC3DCHbits.PSMC3DC13          // bit 5
#define PSMC3DC14               PSMC3DCHbits.PSMC3DC14          // bit 6
#define PSMC3DC15               PSMC3DCHbits.PSMC3DC15          // bit 7

#define PSMC3DC0                PSMC3DCLbits.PSMC3DC0           // bit 0
#define PSMC3DC1                PSMC3DCLbits.PSMC3DC1           // bit 1
#define PSMC3DC2                PSMC3DCLbits.PSMC3DC2           // bit 2
#define PSMC3DC3                PSMC3DCLbits.PSMC3DC3           // bit 3
#define PSMC3DC4                PSMC3DCLbits.PSMC3DC4           // bit 4
#define PSMC3DC5                PSMC3DCLbits.PSMC3DC5           // bit 5
#define PSMC3DC6                PSMC3DCLbits.PSMC3DC6           // bit 6
#define PSMC3DC7                PSMC3DCLbits.PSMC3DC7           // bit 7

#define P3DCST                  PSMC3DCSbits.P3DCST             // bit 0
#define P3DCSC1                 PSMC3DCSbits.P3DCSC1            // bit 1
#define P3DCSC2                 PSMC3DCSbits.P3DCSC2            // bit 2
#define P3DCSC3                 PSMC3DCSbits.P3DCSC3            // bit 3
#define P3DCSC4                 PSMC3DCSbits.P3DCSC4            // bit 4
#define P3DCSIN                 PSMC3DCSbits.P3DCSIN            // bit 7

#define P3FEBSC1                PSMC3FEBSbits.P3FEBSC1          // bit 1
#define P3FEBSC2                PSMC3FEBSbits.P3FEBSC2          // bit 2
#define P3FEBSC3                PSMC3FEBSbits.P3FEBSC3          // bit 3
#define P3FEBSC4                PSMC3FEBSbits.P3FEBSC4          // bit 4
#define P3FEBSIN                PSMC3FEBSbits.P3FEBSIN          // bit 7

#define PSMC3FFA0               PSMC3FFAbits.PSMC3FFA0          // bit 0
#define PSMC3FFA1               PSMC3FFAbits.PSMC3FFA1          // bit 1
#define PSMC3FFA2               PSMC3FFAbits.PSMC3FFA2          // bit 2
#define PSMC3FFA3               PSMC3FFAbits.PSMC3FFA3          // bit 3

#define P3TPRIF                 PSMC3INTbits.P3TPRIF            // bit 0
#define P3TDCIF                 PSMC3INTbits.P3TDCIF            // bit 1
#define P3TPHIF                 PSMC3INTbits.P3TPHIF            // bit 2
#define P3TOVIF                 PSMC3INTbits.P3TOVIF            // bit 3
#define P3TPRIE                 PSMC3INTbits.P3TPRIE            // bit 4
#define P3TDCIE                 PSMC3INTbits.P3TDCIE            // bit 5
#define P3TPHIE                 PSMC3INTbits.P3TPHIE            // bit 6
#define P3TOVIE                 PSMC3INTbits.P3TOVIE            // bit 7

#define P3MSRC0                 PSMC3MDLbits.P3MSRC0            // bit 0
#define P3MSRC1                 PSMC3MDLbits.P3MSRC1            // bit 1
#define P3MSRC2                 PSMC3MDLbits.P3MSRC2            // bit 2
#define P3MSRC3                 PSMC3MDLbits.P3MSRC3            // bit 3
#define P3MDLBIT                PSMC3MDLbits.P3MDLBIT           // bit 5
#define P3MDLPOL                PSMC3MDLbits.P3MDLPOL           // bit 6
#define P3MDLEN                 PSMC3MDLbits.P3MDLEN            // bit 7

#define P3OEA                   PSMC3OENbits.P3OEA              // bit 0
#define P3OEB                   PSMC3OENbits.P3OEB              // bit 1
#define P3OEC                   PSMC3OENbits.P3OEC              // bit 2
#define P3OED                   PSMC3OENbits.P3OED              // bit 3
#define P3OEE                   PSMC3OENbits.P3OEE              // bit 4
#define P3OEF                   PSMC3OENbits.P3OEF              // bit 5

#define PSMC3PH8                PSMC3PHHbits.PSMC3PH8           // bit 0
#define PSMC3PH9                PSMC3PHHbits.PSMC3PH9           // bit 1
#define PSMC3PH10               PSMC3PHHbits.PSMC3PH10          // bit 2
#define PSMC3PH11               PSMC3PHHbits.PSMC3PH11          // bit 3
#define PSMC3PH12               PSMC3PHHbits.PSMC3PH12          // bit 4
#define PSMC3PH13               PSMC3PHHbits.PSMC3PH13          // bit 5
#define PSMC3PH14               PSMC3PHHbits.PSMC3PH14          // bit 6
#define PSMC3PH15               PSMC3PHHbits.PSMC3PH15          // bit 7

#define PSMC3PH0                PSMC3PHLbits.PSMC3PH0           // bit 0
#define PSMC3PH1                PSMC3PHLbits.PSMC3PH1           // bit 1
#define PSMC3PH2                PSMC3PHLbits.PSMC3PH2           // bit 2
#define PSMC3PH3                PSMC3PHLbits.PSMC3PH3           // bit 3
#define PSMC3PH4                PSMC3PHLbits.PSMC3PH4           // bit 4
#define PSMC3PH5                PSMC3PHLbits.PSMC3PH5           // bit 5
#define PSMC3PH6                PSMC3PHLbits.PSMC3PH6           // bit 6
#define PSMC3PH7                PSMC3PHLbits.PSMC3PH7           // bit 7

#define P3PHST                  PSMC3PHSbits.P3PHST             // bit 0
#define P3PHSC1                 PSMC3PHSbits.P3PHSC1            // bit 1
#define P3PHSC2                 PSMC3PHSbits.P3PHSC2            // bit 2
#define P3PHSC3                 PSMC3PHSbits.P3PHSC3            // bit 3
#define P3PHSC4                 PSMC3PHSbits.P3PHSC4            // bit 4
#define P3PHSIN                 PSMC3PHSbits.P3PHSIN            // bit 7

#define P3POLA                  PSMC3POLbits.P3POLA             // bit 0
#define P3POLB                  PSMC3POLbits.P3POLB             // bit 1
#define P3POLC                  PSMC3POLbits.P3POLC             // bit 2
#define P3POLD                  PSMC3POLbits.P3POLD             // bit 3
#define P3POLE                  PSMC3POLbits.P3POLE             // bit 4
#define P3POLF                  PSMC3POLbits.P3POLF             // bit 5
#define P3INPOL                 PSMC3POLbits.P3INPOL            // bit 6

