OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1784.h
#define PSMC3PR8                PSMC3PRHbits.PSMC3PR8           // bit 0
#define PSMC3PR9                PSMC3PRHbits.PSMC3PR9           // bit 1
#define PSMC3PR10               PSMC3PRHbits.PSMC3PR10          // bit 2
#define PSMC3PR11               PSMC3PRHbits.PSMC3PR11          // bit 3
#define PSMC3PR12               PSMC3PRHbits.PSMC3PR12          // bit 4
#define PSMC3PR13               PSMC3PRHbits.PSMC3PR13          // bit 5
#define PSMC3PR14               PSMC3PRHbits.PSMC3PR14          // bit 6
#define PSMC3PR15               PSMC3PRHbits.PSMC3PR15          // bit 7

#define PSMC3PR0                PSMC3PRLbits.PSMC3PR0           // bit 0
#define PSMC3PR1                PSMC3PRLbits.PSMC3PR1           // bit 1
#define PSMC3PR2                PSMC3PRLbits.PSMC3PR2           // bit 2
#define PSMC3PR3                PSMC3PRLbits.PSMC3PR3           // bit 3
#define PSMC3PR4                PSMC3PRLbits.PSMC3PR4           // bit 4
#define PSMC3PR5                PSMC3PRLbits.PSMC3PR5           // bit 5
#define PSMC3PR6                PSMC3PRLbits.PSMC3PR6           // bit 6
#define PSMC3PR7                PSMC3PRLbits.PSMC3PR7           // bit 7

#define P3PRST                  PSMC3PRSbits.P3PRST             // bit 0
#define P3PRSC1                 PSMC3PRSbits.P3PRSC1            // bit 1
#define P3PRSC2                 PSMC3PRSbits.P3PRSC2            // bit 2
#define P3PRSC3                 PSMC3PRSbits.P3PRSC3            // bit 3
#define P3PRSC4                 PSMC3PRSbits.P3PRSC4            // bit 4
#define P3PRSIN                 PSMC3PRSbits.P3PRSIN            // bit 7

#define P3REBSC1                PSMC3REBSbits.P3REBSC1          // bit 1
#define P3REBSC2                PSMC3REBSbits.P3REBSC2          // bit 2
#define P3REBSC3                PSMC3REBSbits.P3REBSC3          // bit 3
#define P3REBSC4                PSMC3REBSbits.P3REBSC4          // bit 4
#define P3REBSIN                PSMC3REBSbits.P3REBSIN          // bit 7

#define P3STRA                  PSMC3STR0bits.P3STRA            // bit 0
#define P3STRB                  PSMC3STR0bits.P3STRB            // bit 1
#define P3STRC                  PSMC3STR0bits.P3STRC            // bit 2
#define P3STRD                  PSMC3STR0bits.P3STRD            // bit 3
#define P3STRE                  PSMC3STR0bits.P3STRE            // bit 4
#define P3STRF                  PSMC3STR0bits.P3STRF            // bit 5

#define P3HSMEN                 PSMC3STR1bits.P3HSMEN           // bit 0
#define P3LSMEN                 PSMC3STR1bits.P3LSMEN           // bit 1
#define P3SSYNC                 PSMC3STR1bits.P3SSYNC           // bit 7

#define P3SYNC0                 PSMC3SYNCbits.P3SYNC0           // bit 0
#define P3SYNC1                 PSMC3SYNCbits.P3SYNC1           // bit 1
#define P3SYNC2                 PSMC3SYNCbits.P3SYNC2           // bit 2
#define P3DCPOL                 PSMC3SYNCbits.P3DCPOL           // bit 5
#define P3PRPOL                 PSMC3SYNCbits.P3PRPOL           // bit 6
#define P3POFST                 PSMC3SYNCbits.P3POFST           // bit 7

#define PSMC3TMR8               PSMC3TMRHbits.PSMC3TMR8         // bit 0
#define PSMC3TMR9               PSMC3TMRHbits.PSMC3TMR9         // bit 1
#define PSMC3TMR10              PSMC3TMRHbits.PSMC3TMR10        // bit 2
#define PSMC3TMR11              PSMC3TMRHbits.PSMC3TMR11        // bit 3
#define PSMC3TMR12              PSMC3TMRHbits.PSMC3TMR12        // bit 4
#define PSMC3TMR13              PSMC3TMRHbits.PSMC3TMR13        // bit 5
#define PSMC3TMR14              PSMC3TMRHbits.PSMC3TMR14        // bit 6
#define PSMC3TMR15              PSMC3TMRHbits.PSMC3TMR15        // bit 7

#define PSMC3TMR0               PSMC3TMRLbits.PSMC3TMR0         // bit 0
#define PSMC3TMR1               PSMC3TMRLbits.PSMC3TMR1         // bit 1
#define PSMC3TMR2               PSMC3TMRLbits.PSMC3TMR2         // bit 2
#define PSMC3TMR3               PSMC3TMRLbits.PSMC3TMR3         // bit 3
#define PSMC3TMR4               PSMC3TMRLbits.PSMC3TMR4         // bit 4
#define PSMC3TMR5               PSMC3TMRLbits.PSMC3TMR5         // bit 5
#define PSMC3TMR6               PSMC3TMRLbits.PSMC3TMR6         // bit 6
#define PSMC3TMR7               PSMC3TMRLbits.PSMC3TMR7         // bit 7

#define RX9D                    RC1STAbits.RX9D                 // bit 0
#define OERR                    RC1STAbits.OERR                 // bit 1
#define FERR                    RC1STAbits.FERR                 // bit 2
#define ADDEN                   RC1STAbits.ADDEN                // bit 3
#define CREN                    RC1STAbits.CREN                 // bit 4
#define SREN                    RC1STAbits.SREN                 // bit 5
#define RX9                     RC1STAbits.RX9                  // bit 6
#define SPEN                    RC1STAbits.SPEN                 // bit 7

#define SLRCONA0                SLRCONAbits.SLRCONA0            // bit 0
#define SLRCONA1                SLRCONAbits.SLRCONA1            // bit 1
#define SLRCONA2                SLRCONAbits.SLRCONA2            // bit 2
#define SLRCONA3                SLRCONAbits.SLRCONA3            // bit 3
#define SLRCONA4                SLRCONAbits.SLRCONA4            // bit 4
#define SLRCONA5                SLRCONAbits.SLRCONA5            // bit 5
#define SLRCONA6                SLRCONAbits.SLRCONA6            // bit 6
#define SLRCONA7                SLRCONAbits.SLRCONA7            // bit 7

#define SLRCONB0                SLRCONBbits.SLRCONB0            // bit 0
#define SLRCONB1                SLRCONBbits.SLRCONB1            // bit 1
#define SLRCONB2                SLRCONBbits.SLRCONB2            // bit 2
#define SLRCONB3                SLRCONBbits.SLRCONB3            // bit 3
#define SLRCONB4                SLRCONBbits.SLRCONB4            // bit 4
#define SLRCONB5                SLRCONBbits.SLRCONB5            // bit 5
#define SLRCONB6                SLRCONBbits.SLRCONB6            // bit 6
#define SLRCONB7                SLRCONBbits.SLRCONB7            // bit 7

#define SLRCONC0                SLRCONCbits.SLRCONC0            // bit 0
#define SLRCONC1                SLRCONCbits.SLRCONC1            // bit 1
#define SLRCONC2                SLRCONCbits.SLRCONC2            // bit 2
#define SLRCONC3                SLRCONCbits.SLRCONC3            // bit 3
#define SLRCONC4                SLRCONCbits.SLRCONC4            // bit 4
#define SLRCONC5                SLRCONCbits.SLRCONC5            // bit 5
#define SLRCONC6                SLRCONCbits.SLRCONC6            // bit 6
#define SLRCONC7                SLRCONCbits.SLRCONC7            // bit 7

